{"backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 2], "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 5, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 2, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null}}], "class_name": "Sequential", "keras_version": "2.1.2"}