{"backend": "tensorflow", "config": [{"config": {"name": "conv1d_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "strides": [2], "dilation_rate": [1], "padding": "same", "kernel_size": [2], "batch_input_shape": [null, 32, 1], "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 1}, "class_name": "Conv1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "batch_input_shape": [null, 32], "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "units": 16, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "units": 16, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_3", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "units": 16, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_4", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "units": 8, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_5", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "units": 3, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.1.2", "class_name": "Sequential"}