{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "bias_constraint": null, "dtype": "float32", "strides": [3], "activation": "sigmoid", "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "filters": 1, "kernel_constraint": null, "batch_input_shape": [null, 45, 1], "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "units": 15, "batch_input_shape": [null, 45], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 15, "use_bias": true, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 15, "use_bias": true, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 8, "use_bias": true, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 3, "use_bias": true, "kernel_regularizer": null, "trainable": true}}]}