{"keras_version": "2.1.2", "config": [{"config": {"activity_regularizer": null, "activation": "sigmoid", "units": 14, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "batch_input_shape": [null, 14]}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "sigmoid", "units": 14, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "sigmoid", "units": 14, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "sigmoid", "units": 7, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_4", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "sigmoid", "units": 1, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_5", "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}