{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.2", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "units": 25, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "batch_input_shape": [null, 4], "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "units": 15, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "units": 10, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null}}]}