{"class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 6], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true}}]}